export const colorTokens = {
  gray: {
    50: { value: '#f8fafc' },
    100: { value: '#f1f5f9' },
    200: { value: '#e2e8f0' },
    300: { value: '#cbd5e1' },
    400: { value: '#94a3b8' },
    500: { value: '#64748b' },
    600: { value: '#475569' },
    700: { value: '#334155' },
    800: { value: '#1e293b' },
    900: { value: '#0f172a' },
    950: { value: '#020617' },
  },

  sky: {
    50: { value: 'oklch(0.977 0.013 236.62)' },
    100: { value: 'oklch(0.951 0.026 236.824)' },
    200: { value: 'oklch(0.901 0.058 230.902)' },
    300: { value: 'oklch(0.828 0.111 230.318)' },
    400: { value: 'oklch(0.746 0.16 232.661)' },
    500: { value: 'oklch(0.685 0.169 237.323)' },
    600: { value: 'oklch(0.588 0.158 241.966)' },
    700: { value: 'oklch(0.5 0.134 242.749)' },
    800: { value: 'oklch(0.443 0.11 240.79)' },
    900: { value: 'oklch(0.391 0.09 240.876)' },
    950: { value: 'oklch(0.293 0.066 243.157)' },
  },
  violet: {
    50: { value: 'oklch(0.973 0.014 286.451)' },
    100: { value: 'oklch(0.952 0.032 285.668)' },
    200: { value: 'oklch(0.912 0.067 284.821)' },
    300: { value: 'oklch(0.853 0.124 283.367)' },
    400: { value: 'oklch(0.765 0.194 281.564)' },
    500: { value: 'oklch(0.658 0.233 280.342)' },
    600: { value: 'oklch(0.569 0.224 279.437)' },
    700: { value: 'oklch(0.487 0.206 278.394)' },
    800: { value: 'oklch(0.411 0.17 277.217)' },
    900: { value: 'oklch(0.351 0.138 276.454)' },
    950: { value: 'oklch(0.248 0.092 275.201)' },
  },
  // 상태(성공,에러,경고)를 위한 색
  success: {
    // teal 계열
    500: { value: 'oklch(0.706 0.156 175.8)' },
  },
  error: {
    // rose계열
    500: { value: 'oklch(0.645 0.216 16.44)' },
  },
  warn: {
    // amber계열
    500: { value: 'oklch(0.769 0.188 70.08)' },
  },
};
